
#   //  тригеры для логики  //

Trigger = {
    #   регистрация
    'Reg': True,
    'Send': False,
    #   меню
    'Main': True,
    'Profile': False,
    'Rasp': False,
    'Admin': False
}

admin_list = [
    177157427,
    501057196
]

cache_dict = {}

#   //    инофрмация о пользователе   //

#   id          //  id вконтакте    //  Все
#   role        //  Роль            //  Все
#   last_name   //  Фамилия         //  Преподаватели
#   group       //  Группа          //  Студенты
#   admin       //  Администратор   //  Все


#   //    ключи    //

role = ['Студент', 'Преподаватель']
corpus = ['1', '2']
course = ['1', '2', '3', '4']
group_one_one = ['1Ф8', '1ИС3', '1ИС6', '1ПД7', 
'1ПД1', '1ПД16', '1Б2', '1ГД11', "12Б10"]
group_one_two = ['2Ф8', '2ИС3', '2Т1', '2ПД7', 
'2ООП6', '2ГД11', '2Б2', '23Т10']
group_one_three = ['3Ф8', '3Б2', '3Т1', '3ПД7', 
'3ГД11', '3ИС3', '3ООП6', '34Т10']
group_one_four = ['4ИС3', '4ООП6', '4Т1', '4ПД7', 
'4ГД11']
group_two_one = ['1ПСО12', '1ПСО13', '1Р5', '1К4', 
'12К9', '12ПСО14', '12ПСО15']
group_two_two = ['2ЛОГ4', '2ПСО12', '2ПСО13', '2Р5', 
'23К9', '23ПСО14', '23ПСО15']
group_two_three = ['3Р5', '3ПСО12', '3ПСО13', '3К4']
group_two_four = ['4ПСО12', '4ПСО13']
menu_key = ["Расписание", "Профиль", "Админ"]
rasp = ['По группам', 'По преподавателям', 'Назад']
admin = ['Нюхнуть бебры', 'Рассылка', 'Пукнуть сливой', 'Назад']